/*
 * HDC1080.c
 *
 *  Created on: Aug 23, 2023
 *      Author: Solderingiron
 */


#include "HDC1080.h"

uint8_t I2C1_tx_buffer[4] = { 0, };  //§ª§ã§ç§à§Õ§ñ§ë§Ú§Û §Ò§å§æ§Ö§â
uint8_t I2C1_rx_buffer[10] = { 0, };  //§£§ç§à§Õ§ñ§ë§Ú§Û §Ò§å§æ§Ö§â
float Temperature, Humidity;

void HDC1080_init(void){
    /*-------------------§±§â§à§ã§Þ§à§ä§â §ß§Ñ§ã§ä§â§à§Ö§Ü §Õ§Ý§ñ §Þ§à§Õ§å§Ý§ñ HDC1080-------------------*/
    I2C1_tx_buffer[0] = 0x02;  //§¬§à§Þ§Ñ§ß§Õ§Ñ §Ü§à§ß§æ§Ú§Ô§å§â§Ñ§è§Ú§ñ
    I2C1_tx_buffer[1] = 0x10;
    I2C1_tx_buffer[2] = 0x00;
    //§³§Ü§Ñ§Ø§Ö§Þ §Þ§à§Õ§å§Ý§ð, §é§ä§à §ç§à§ä§Ú§Þ §Ù§Ñ§á§Ú§ã§Ñ§ä§î §Õ§Ñ§ß§ß§í§Ö §ß§Ñ §Ñ§Õ§â§Ö§ã "Configuration" §ã§à §Ù§ß§Ñ§é§Ö§ß§Ú§Ö§Þ 0x0000
    RVMSIS_I2C_Data_Transmit(I2C1, HDC1080ADDR, I2C1_tx_buffer, 3, 100);
    Delay_ms(20);
    //§³§Ü§Ñ§Ø§Ö§Þ §Þ§à§Õ§å§Ý§ð, §é§ä§à §ç§à§ä§Ú§Þ §á§â§à§ã§Þ§à§ä§â§Ö§ä§î §Õ§Ñ§ß§ß§í§Ö §ã §Ñ§Õ§â§Ö§ã§Ñ "Configuration"
    RVMSIS_I2C_Data_Transmit(I2C1, HDC1080ADDR, I2C1_tx_buffer, 1, 100);
    Delay_ms(20);
    //§³§à§ç§â§Ñ§ß§Ú§Þ §Ü§à§ß§æ§Ú§Ô§å§â§Ñ§è§Ú§ð §Ó §á§Ö§â§Ö§Þ§Ö§ß§ß§å§ð
    RVMSIS_I2C_Data_Receive(I2C1, HDC1080ADDR, I2C1_rx_buffer, 2, 100);
    /*-------------------§±§â§à§ã§Þ§à§ä§â §ß§Ñ§ã§ä§â§à§Ö§Ü §Õ§Ý§ñ §Þ§à§Õ§å§Ý§ñ HDC1080-------------------*/
}
